# Imports

In [55]:
import pandas as pd

# Data

## Attributes

In [65]:
transx = pd.read_csv("../data/transactions.csv")

In [72]:
stores = pd.read_csv("../data/stores.csv")

In [66]:
oil = pd.read_csv("../data/oil.csv")

In [67]:
holidays = pd.read_csv("../data/holidays_events.csv")

## Samples Outputs

In [73]:
train = pd.read_csv("../data/train.csv")

In [74]:
test = pd.read_csv("../data/test.csv")

## Attribute Exploration

In [81]:
transx.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [86]:
transx.shape

(83488, 3)

In [76]:
stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [85]:
stores.shape

(54, 5)

In [77]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [84]:
oil.shape

(1218, 2)

Oil will be useful for providing a continuous numerical bias to our model. It is onsidered to be a ratio value, I think.

In [88]:
holidays.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [90]:
holidays.shape

(350, 6)

Holidays will be useful for understanding any captured anomalies our model may pickup. We will keep them in mind when interpreting inaccuracy in scores or any explanation of our model's limits. These anamolies are ordinal, as well. We can likely fine tune a model to understand these events and treat them in a specific way that best helps us plan for our business' supply and demand.

In [91]:
train.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [92]:
train.shape

(3000888, 6)